[
 {
  "director": "Carlos Saldanha",
  "rating": 0,
  "showtime": 1388279380,
  "description": "Ellie (Queen Latifah) and Manny (Ray Romano) are expecting their first child, and Manny is nervously obsessed with making life perfect and safe for Ellie, until the baby's born, since his first experiences as a husband and father went bad when his family was killed by hunters. At the same time, Diego (Denis Leary) finds himself unable to catch a cocky gazelle (Bill Hader) he has been stalking and decides to leave the herd, believing that he is losing his predatory nature as a tiger. Sid (John Leguizamo) grows jealous of Manny and Ellie and 'adopts' three apparently abandoned eggs that he finds in an icy underground cavern and call them Eggbert, Shelly, and Yoko. Manny tells him to put them back (saying Sid would never make a good parent, saying, 'First sign: Stealing someone else's eggs. Second sign: One of them almost became an omelette.'), but Sid instead looks after the eggs, which hatch into baby Tyrannosaurus triplets the next morning.",
  "title": "Ice Age: Dawn of the Dinosaurs",
  "id": 10,
  "year": 2009,
  "length": 94,
  "genres": [
   "Animation",
   "Action",
   "Adventure"
  ]
 },
 {
  "director": "Ron Howard",
  "rating": 0,
  "showtime": 1388711180,
  "description": "Andy, now nearly 18 year's old, is leaving for college, and his toys have not been played with in year's. Andy decides to take Woody with him to college and puts Buzz Lightyear and the rest of the toys in a trash bag for storage in the attic. Andy's mother mistakes the bag for garbage and puts it on the curb. The toys escape and, believing Andy intended to throw them away, decide to climb in a donation box bound for Sunnyside Daycare. Woody follows the other toys and tries to explain that they were thrown out by mistake, but they refuse to believe him.",
  "title": "Toy Story 3",
  "id": 11,
  "year": 2010,
  "length": 103,
  "genres": [
   "Animation",
   "Adventure",
   "Comedy"
  ]
 },
 {
  "director": "Christopher Nolan",
  "rating": 0,
  "showtime": 1388798180,
  "description": "Dominick Cobb (Leonardo DiCaprio) and business partner Arthur (Joseph Gordon-Levitt) perform corporate espionage using an experimental military technology to infiltrate the subconscious of their targets and extract information while dreaming. Their latest target is Japanese businessman Saito (Ken Watanabe). Tiered 'dream within a dream' strategies are used and dreamers awaken by a 'kick' such as dying in the dream or falling. If the dreamer is the one who awakens, the dream 'collapses'. Each 'extractor' carries a totem, a small object whose behavior only its owner can predict, used to determine whether a dreamer is in someone else's dream. Cobb's totem is implied to be a spinning top that spins perpetually in the dream state. The extraction fails when sabotaged by a memory of Cobb's deceased wife Mal (Marion Cotillard). Saito reveals, after Cobb's and Arthur's associate sells them out, that he was actually auditioning the team to perform the difficult act of 'inception': planting an idea in a person's subconscious while they sleep. ",
  "title": "Inception",
  "id": 0,
  "year": 2010,
  "length": 148,
  "genres": [
   "Action",
   "Adventure",
   "Mystery"
  ]
 },
 {
  "director": "David Slade",
  "rating": 0,
  "showtime": 1388788180,
  "description": "In Seattle, not far from Forks, Victoria (Bryce Dallas Howard) attacks and bites Riley Biers (Xavier Samuel), in order to begin creating an army of newborns with him. Back in Forks, Edward Cullen (Robert Pattinson) and Bella Swan (Kristen Stewart) discuss the complications of becoming an immortal vampire. At 18 year's old, one year older than the age Edward was when he became a vampire, Bella expresses her aversion to the idea of marrying so young, though Edward refuses to turn her into a vampire until they are married, his argument that she should have various human experiences she would otherwise miss. While Charlie Swan (Billy Burke) investigates the disappearance of Riley Biers, Edward suspects his disappearance was caused by the newborn vampires. Furthering his suspicions is Riley's intrusion into Bella's room.",
  "title": "The Twilight Saga: Eclipse",
  "id": 13,
  "year": 2010,
  "length": 124,
  "genres": [
   "Adventure",
   "Drama",
   "Fantasy"
  ]
 },
 {
  "director": "Brad Bird",
  "rating": 0,
  "showtime": 1388778180,
  "description": "In Budapest to intercept a courier working for a person code-named 'Cobalt', IMF agent Trevor Hanaway is killed by assassin Sabine Moreau. Hanaway's team leader, Jane Carter, and newly promoted field agent Benji Dunn extract Ethan Hunt and Ethan's source, Bogdan, from a Moscow prison. Ethan is recruited to lead Jane and Benji to infiltrate secret Moscow Kremlin archives and locate files identifying Cobalt. During the mission, someone broadcasts across the IMF frequency, alerting the Russians to Ethan's team. Although Benji and Jane escape, a bomb destroys the Kremlin and Russian agent Sidorov arrests Ethan, suspecting him as a key player in the attack.",
  "title": "Mission: Impossible – Ghost Protocol",
  "id": 14,
  "year": 2011,
  "length": 132,
  "genres": [
   "Action",
   "Thriller"
  ]
 },
 {
  "director": "Matthew Vaughn",
  "rating": 0,
  "showtime": 1388766180,
  "description": "In a concentration camp in occupied Poland in 1944, Nazi scientist Dr. Klaus Schmidtobserves young Erik Lensherr bend a metal gate with his mind when the child is separated from his mother. In his office, Schmidt orders Lensherr to move a coin on a desk, killing his mother when Lensherr cannot. In grief and anger, Lensherr's magnetic power manifests, killing two guards and destroying the room. Meanwhile, at a mansion inWestchester County, New York, young telepath Charles Xavier meets young shape-shifter Raven whose natural form is blue. Overjoyed to meet someone else 'different', he invites her to live with his family as his foster sister.",
  "title": "X-Men: First Class",
  "id": 15,
  "year": 2011,
  "length": 132,
  "genres": [
   "Action",
   "Adventure",
   "Sci-Fi"
  ]
 },
 {
  "director": "Quentin Tarantino",
  "rating": 0,
  "showtime": 1386779180,
  "description": "Somewhere in Texas in the year 1858, several male slaves are being driven by the Speck Brothers, Ace and Dicky. Among the shackled slaves is Django, sold off and separated from his wife, Broomhilda. The Speck Brothers are stopped by Dr. King Schultz, a German dentist and bounty hunter. Schultz asks to buy one of the slaves, but while questioning Django about his knowledge of the Brittle Brothers, for whom Schultz is carrying a warrant, he irritates Ace who aims his shotgun at Schultz. Schultz quickly kills Ace and leaves Dicky at the mercy of the other newly-freed slaves. Since Django can identify the Brittle Brothers, Schultz offers Django his freedom in exchange for his help in tracking them down. After executing the Brittles, Django partners with Schultz through the winter and becomes his apprentice. Schultz explains that, being the first person he has ever given freedom to, he feels responsible for Django and is driven to help him in his quest to rescue Broomhilda. Upon first learning of her name, Schultz tells Django the tale of the mythical German valkyrie, Brünnhilde.",
  "title": "Django Unchained",
  "id": 16,
  "year": 2012,
  "length": 165,
  "genres": [
   "Adventure",
   "Drama",
   "Western"
  ]
 },
 {
  "director": "Joss Whedon",
  "rating": 1,
  "showtime": 1384779180,
  "description": "The Asgardian Loki encounters the Other, the leader of an extraterrestrial race known as the Chitauri. In exchange for retrieving the Tesseract,2 a powerful energy source of unknown potential, the Other promises Loki an army with which he can subjugate Earth.Nick Fury, director of the espionage agency S.H.I.E.L.D., and his lieutenant Agent Maria Hill arrive at a remote research facility during an evacuation, where physicist Dr. Erik Selvig is leading a research team experimenting on the Tesseract. Agent Phil Coulson explains that the object has begun radiating an unusual form of energy. The Tesseract suddenly activates and opens a wormhole, allowing Loki to reach Earth. Loki takes the Tesseract and uses his scepter to enslave Selvig and several agents, including Clint Barton, to aid him in his getaway.",
  "title": "The Avengers",
  "id": 17,
  "year": 2012,
  "length": 142,
  "genres": [
   "Action",
   "Fantasy"
  ]
 },
 {
  "director": "Ben Affleck",
  "rating": 1,
  "showtime": 1388749180,
  "description": "Iranians storm the United States embassy in Tehran on November 4, 1979, in retaliation for President Jimmy Carter giving the Shah asylum in the U.S. during the Iranian Revolution. More than fifty of the embassy staff are taken as hostages, but six escape and hide in the home of the Canadian ambassador Ken Taylor (Garber). With the escapees' situation kept secret, the U.S. State Department begins to explore options for exfiltrating them from Iran. Tony Mendez (Ben Affleck), a U.S. Central Intelligence Agency exfiltration specialist brought in for consultation, criticizes the proposals, but is at a loss for an alternative. While on the phone with his son, he is inspired by watching Battle for the Planet of the Apes and begins plans for creating a cover story for the escapees being Canadian filmmakers scouting for exotic locations in Iran for a similar science-fiction film.",
  "title": "Argo",
  "id": 18,
  "year": 2012,
  "length": 120,
  "genres": [
   "Biography",
   "Drama",
   "History"
  ]
 },
 {
  "director": "Niels Arden Oplev",
  "rating": 9,
  "showtime": 1388774180,
  "description": "Victor (Colin Farrell) has infiltrated the criminal empire run by ruthless kingpin Alphonse Hoyt (Terrence Howard), with the objective of making Alphonse pay for killing his wife two year's earlier to prevent a trial after his men also accidentally killed Victor's daughter. Victor watches and is watched by Beatrice (Noomi Rapace), a mysterious young woman who lives in the apartment across from his. Beatrice begins to contact Victor and show interest for him, and on her first date she reveals her true intentions: Beatrice has a video of Victor killing a man and wishes for him to kill a drunk driver who disfigured her through a car collision, otherwise she will contact the police.",
  "title": "Dead Man Down",
  "id": 19,
  "year": 2013,
  "length": 117,
  "genres": [
   "Action",
   "Crime",
   "Drama"
  ]
 }
]
